Revit 2024 API
BuiltInFailures.SiteFailures.SiteEditPointsInvisible Property
 Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics. It is often easier to edit topography in a Site view or a 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SiteEditPointsInvisible { get; }
Visual Basic
Public Shared ReadOnly Property SiteEditPointsInvisible As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SiteEditPointsInvisible {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace